{
    
    "jobs": [
        {
            "id": 1,
            "company_logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Apple_logo_black.svg/1024px-Apple_logo_black.svg.png",
            "job_title": "Software Engineer",
            "company_name": "Apple",
            "remote_or_onsite": "Remote",
            "location": "San Francisco, CA",
            "fulltime_or_parttime": "Fulltime",
            "salary": "120k - 150k",
            "job_description": "Acme Inc. is seeking a talented software engineer to join our team. The ideal candidate will have a strong background in software development, experience working with modern software frameworks and tools, and the ability to work collaboratively with other engineers, product managers, and designers to build great software products.",
            "job_responsibility": "Develop and maintain software applications and systems, collaborate with cross-functional teams to design and implement software solutions, write high-quality code and conduct code reviews, troubleshoot and debug issues, participate in project planning and estimation, and stay up-to-date with emerging trends and technologies in software development.",
            "educational_requirements": "Bachelor's or Master's degree in Computer Science, Software Engineering, or a related field.",
            "experiences": "3+ years of experience in software development.",
            "contact_information": {
                "phone": "555-1234",
                "email": "jobs@acmeinc.com"
            }
        },
        {
            "id": 2,
            "company_logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/Amazon_logo.svg/1024px-Amazon_logo.svg.png",
            "job_title": "Product Manager",
            "company_name": "Amazon",
            "remote_or_onsite": "Onsite",
            "location": "New York, NY",
            "fulltime_or_parttime": "Fulltime",
            "salary": "100k - 130k",
            "job_description": "Widget Corp is looking for an experienced Product Manager to join our team. The ideal candidate will have a strong background in product management, experience working with cross-functional teams, and the ability to think strategically and execute tactically.",
            "job_responsibility": "Develop and execute product roadmap, work closely with design and engineering teams to deliver high-quality products, define product requirements and prioritize features based on customer feedback and market trends, manage product backlog, and drive product adoption and customer engagement.",
            "educational_requirements": "Bachelor's or Master's degree in Business Administration, Marketing, or a related field.",
            "experiences": "5+ years of experience in product management.",
            "contact_information": {
                "phone": "555-5678",
                "email": "jobs@widgetcorp.com"
            }
        },
        {
            "id": 3,
            "company_logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/53/Google_%22G%22_Logo.svg/1200px-Google_%22G%22_Logo.svg.png",
            "job_title": "Data Scientist",
            "company_name": "Google",
            "remote_or_onsite": "Remote",
            "location": "Chicago, IL",
            "fulltime_or_parttime": "Fulltime",
            "salary": "130k - 160k",
            "job_description": "Techtronics is seeking a talented Data Scientist to join our team. The ideal candidate will have a strong background in data analysis, machine learning, and statistical modeling, as well as experience working with large datasets and programming languages such as Python and R.",
            "job_responsibility": "Develop and implement machine learning models and algorithms, design and implement experiments to test hypotheses, analyze and interpret large datasets, and communicate findings to stakeholders in a clear and concise manner.",
            "educational_requirements": "Bachelor's or Master's degree in Computer Science, Statistics, or a related field.",
            "experiences": "3+ years of experience in data science or a related field.",
            "contact_information": {
                "phone": "555-9012",
                "email": "jobs@techtronics.com"
            }
        },
        {
            "id": 4,
            "company_logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/44/Microsoft_logo.svg/1024px-Microsoft_logo.svg.png",
            "job_title": "Registered Nurse",
            "company_name": "Microsoft",
            "remote_or_onsite": "Onsite",
            "location": "Houston, TX",
            "fulltime_or_parttime": "Fulltime",
            "salary": "60k - 80k",
            "job_description": "Medix Health is seeking a Registered Nurse to join our team. The ideal candidate will have a strong background in patient care, excellent communication skills, and the ability to work well under pressure.",
            "job_responsibility": "Provide direct patient care, monitor and record vital signs, administer medications and treatments, communicate with patients and their families, and collaborate with other healthcare professionals to provide high-quality patient care.",
            "educational_requirements": "Bachelor's or Associate degree in Nursing.",
            "experiences": "2+ years of experience in nursing.",
            "contact_information": {
                "phone": "555-3456",
                "email": "jobs@medixhealth.com"
            }
        },
        {
            "id": 5,
            "company_logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1b/Facebook_icon.svg/1200px-Facebook_icon.svg.png",
            "job_title": "Frontend Developer",
            "company_name": "Facebook",
            "remote_or_onsite": "Remote",
            "location": "Washington, DC",
            "fulltime_or_parttime": "Fulltime",
            "salary": "100k - 130k",
            "job_description": "Tech in Motion is looking for a talented Frontend Developer to join our team. The ideal candidate will have a strong background in frontend development, experience working with modern frontend frameworks such as React and Angular, and the ability to work collaboratively with designers, product managers, and backend developers.",
            "job_responsibility": "Develop and maintain web applications using modern frontend frameworks, write high-quality code and conduct code reviews, collaborate with cross-functional teams to design and implement software solutions, troubleshoot and debug issues, and stay up-to-date with emerging trends and technologies in frontend development.",
            "educational_requirements": "Bachelor's or Master's degree in Computer Science, Software Engineering, or a related field.",
            "experiences": "3+ years of experience in frontend development.",
            "contact_information": {
                "phone": "555-7890",
                "email": "jobs@techinmotion.com"
            }
        },
        {
            "id": 6,
            "company_logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/51/Twitter_logo.svg/1200px-Twitter_logo.svg.png",
            "job_title": "Financial Analyst",
            "company_name": "Twitter",
            "remote_or_onsite": "Onsite",
            "location": "Los Angeles, CA",
            "fulltime_or_parttime": "Fulltime",
            "salary": "80k - 100k",
            "job_description": "Prime Finance is looking for a Financial Analyst to join our team. The ideal candidate will have a strong background in finance, experience working with financial models and analysis tools, and theability to communicate financial insights to non-financial stakeholders.",
            "job_responsibility": "Conduct financial analysis and modeling to support business decisions, prepare financial reports and presentations, monitor and analyze financial performance, identify trends and insights, and make recommendations for improving financial performance.",
            "educational_requirements": "Bachelor's or Master's degree in Finance, Accounting, or a related field.",
            "experiences": "3+ years of experience in financial analysis or a related field.",
            "contact_information": {
                "phone": "555-2345",
                "email": "jobs@primefinance.com"
            }
        },
        {
            "id": 7,
            "company_logo": "https://www.coca-colacompany.com/content/experience-fragments/journey/navigation/us/en/navigation/master/_jcr_content/root/proxycorecontainer_c/proxycorecontainer/proxycoreimage.coreimg.svg/1662664226237/tccc-primarywordmark-horizontal-black.svg",
            "job_title": "Software Engineer",
            "company_name": "Coca-Cola",
            "remote_or_onsite": "Remote",
            "location": "San Francisco, CA",
            "fulltime_or_parttime": "Fulltime",
            "salary": "120k - 150k",
            "job_description": "TechPro is seeking a talented Software Engineer to join our team. The ideal candidate will have a strong background in software development, experience working with modern programming languages such as Java and Python, and the ability to work collaboratively with other engineers, designers, and product managers.",
            "job_responsibility": "Design, develop, test, and maintain high-quality software solutions, write clean, maintainable, and efficient code, collaborate with cross-functional teams to design and implement software solutions, troubleshoot and debug issues, and stay up-to-date with emerging trends and technologies in software development.",
            "educational_requirements": "Bachelor's or Master's degree in Computer Science, Software Engineering, or a related field.",
            "experiences": "5+ years of experience in software development.",
            "contact_information": {
                "phone": "555-5678",
                "email": "jobs@techpro.com"
            }
        },
        {
            "id": 8,
            "company_logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a6/Logo_NIKE.svg/1200px-Logo_NIKE.svg.png",
            "job_title": "Physical Therapist",
            "company_name": "Nike",
            "remote_or_onsite": "Onsite",
            "location": "New York, NY",
            "fulltime_or_parttime": "Parttime",
            "salary": "60 - 80 per hour",
            "job_description": "Wellness Care is seeking a licensed Physical Therapist to join our team. The ideal candidate will have a strong background in physical therapy, excellent communication and interpersonal skills, and the ability to work collaboratively with other healthcare professionals to provide high-quality patient care.",
            "job_responsibility": "Conduct patient evaluations, develop and implement individualized treatment plans, monitor and record patient progress, communicate with patients and their families, and collaborate with other healthcare professionals to provide high-quality patient care.",
            "educational_requirements": "Doctor of Physical Therapy (DPT) degree from an accredited program and a state license to practice physical therapy.",
            "experiences": "2+ years of experience in physical therapy.",
            "contact_information": {
                "phone": "555-6789",
                "email": "jobs@wellnesscare.com"
            }
        },
        {
            "id": 9,
            "company_logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/36/McDonald%27s_Golden_Arches.svg/1200px-McDonald%27s_Golden_Arches.svg.png",
            "job_title": "Instructional Designer",
            "company_name": "McDonald's",
            "remote_or_onsite": "Remote",
            "location": "Seattle, WA",
            "fulltime_or_parttime": "Fulltime",
            "salary": "80k - 100k",
            "job_description": "EdTech is seeking an experienced Instructional Designer to join our team. The ideal candidate will have a strong background in instructional design, knowledge of adult learning theory, and experience developing high-quality online learning experiences.",
            "job_responsibility": "Collaborate with subject matter experts to design and develop engaging and effective online courses, develop and manage project plans, ensure courses are delivered on time and on budget, and stay up-to-date with emerging trends and technologies in online learning.",
            "educational_requirements": "Bachelor's or Master's degree in Instructional Design, Education, or a related field.",
            "experiences": "3+ years of experience in instructional design or a related field.",
            "contact_information": {
                "phone": "555-7890",
                "email": "jobs@edtech.com"
            }
        },
        {
            "id": 10,
            "company_logo": "https://www.logo.wine/a/logo/SpaceX/SpaceX-Logo.wine.svg",
            "job_title": "Marketing Manager",
            "company_name": "SpaceX",
            "remote_or_onsite": "Onsite",
            "location": "Boston, MA",
            "fulltime_or_parttime": "Fulltime",
            "salary": "100k - 120k",
            "job_description": "MarketingPro is seeking a talented Marketing Manager to join our team. The ideal candidate will have a strong background in marketing, experience developing and implementing marketing campaigns, and excellent communication and leadership skills.",
            "job_responsibility": "Develop and implement marketing strategies and campaigns, analyze market trends and data, manage marketing budgets and timelines, collaborate with cross-functional teams to execute marketing initiatives, and lead and mentor marketing team members.",
            "educational_requirements": "Bachelor's or Master's degree in Marketing, Business Administration, or a related field.",
            "experiences": "5+ years of experience in marketing or a related field.",
            "contact_information": {
                "phone": "555-8901",
                "email": "jobs@marketingpro.com"
            }
        }
    ]
}